# TODO: Основы Selenium!

'''
Первым делом нужно собрать проект автотестов, вот шаблон, использующий лучшие практики:
tests/              - Директория наших тестов
├── pages/          - Директория где хранятся локаторы и методы для работы со страницами TODO: Pattern Page Object
│   ├── base_page.py
│   ├── login_page.py
├── conftest.py     - Конфигурационный файл проекта автотестов
├── test_login.py   - Модуль с АТ по форме логина\авторизации
requirements.txt    - Список необходимых библиотек для работы автотестов
pytest.ini          - Конфигурационный файл библиотеки pytest

После того как "каркас" проекта автотестов готов, нужно создать виртуальную среду и установить все зависимости:
pip install -r requirements.txt


'''